import { useRef } from "react";
import Sound from "./atoms/Sound";
import { useState } from "react";
export default function ProfileModalAudio({ isOpen, onClose, button }) {
    const content = {
        1: {
            title: "رعمسيس",
            text: "  كانت رعمسيس هي أول نقطة إنطلاق",
            audio: "/audio/raamsis.mp4",
            image:"/pics/ramsis.jpeg",
        },
           2: {
            title: "سكوت",
            text: <h2> <b>"سكوت"</b> كانت أول محطة راحة بعد تحرك الشعب <br/>سكوت معناها "مظلات" وهي بين الإسماعيلية والسويس حاليًا ولكن نحو الغرب قليلًا.<br/>الأحداث: شريعة تقديس الأبكار وحفظ الفطير لمدة اسبوع

تقديس كل بكر فالله يريد أن يكون الأول فِي حياتنا
الله انقذ أبكار الشعب لذلك وجب أن يكونوا ملكا له<br/>

 <b>العلامة أوريجانوس:</b> السكن في الخيام يشير إلى الإسراع نحو الله ونحن مستعدين لذلك بلا عائق.<br/><b>+ تيَهان الشعب:</b>
اندهش الشعب إذ رأى نفسه يسير في طريق غير طريق فلسطين، فإنه إذ كان لم يتدرب بعد على الحرية، أراد الله أن يتدرج به في البرية حتى يبلغ به إلى أرض الحرية "قال لئلاَّ يندم إذا رأوا حربًا ويرجعوا إلى مصر"</h2>,
            audio: "/audio/skoot.m4a",
            image:"/pics/skoot.jpeg",
        },
        3: {
            title: "إيثام",
            text: <h2><b>"إيثام"</b>  "الآيات الإلهية" وهي جنوب البحيرات المرة وشمال غرب خليج السويس (شرق سكوت)<br/>هناك رأوا صحراء سيناء أمامهم ولكنهم لم يعبروا بعد<br /> <b>الأحداث:</b> الله كان يسير أمامهم نهارًا في عمود سحاب ليهديهم في الطريق، وليلًا في عمود نار لينير لهم. <br /> <b>بولس الرسول </b> يرى في السحابة التي ظللت الشعب المعمودية (١ كو ٦: ٢)، التي خلالها ننال روح التبنِّي بالروح القدس. <br /><b>القدِّيس باسيليوس الكبير:</b> يرى فيها "ظل نعمة الروح القدس الذي يُعطي برودة للهيب شهواتنا، بإماتة أعضائنا" (كو ٣: ٥)، بهذا يكون عمود النور ظلًا للاستنارة التي نلناها بالمعمودية لنسير في طريق الرب المخلص خلال ظلمة هذه الحياة. </h2>,
            audio: "/audio/etham.aac",
            image:"/pics/etham.jpeg",
        },
     
          4: {
            title: "مجدل",
            text: <h2><b>المعنى:</b> برج أو حصنل<br /><b>المرجع الكتابي:</b> خروج 14: 1-2، 9 ؛ عدد 33: 7 <br /><b>النوع:</b> موقع عسكري وحراسة
            <br /><b>الحدث الأهم:</b> التخييم قبل عبور البحر <br /><b>الدرس الروحي:</b> الله يعمل عندما تبدو كل الطرق مغلقة <br /><b>الآية المفتاحية:</b> اسم الرب برج حصين" (أم 18: 10) </h2>,
            audio: "/audio/magdal.mp4",
            image:"/pics/magdal.jpeg",
        },
        5: {
            title: "فم حيروث",
            text: <h2><b>المكان الفعلي :</b> تقع المنطقة جغرافياً على الشاطئ الغربي للبحر الأحمر، مما جعلها موقعاً طبيعياً يحصر بني إسرائيل ويمنعهم من التقدم أو التراجع 
            <br /><b>المشهد الطبيعي :</b>كانت التضاريس عبارة عن حصار طبيعي الجبال أو الحصون من جانب - مجدل - ومياه البحر من الجانب الآخر. <br /> 
            <b>الفخ الاستراتيجي:</b>تهدف التوجيهات الإلهية بالتخييم في هذه البقعة الدقيقة إلى إظهار بني إسرائيل وكأنهم تائهون ومحبوسون في البرية. <br /><b>نية فرعون :</b>
            عندما علم فرعون أن الشعب محاصر في هذه النقطة، ظن أنهم وقعوا في فخ واضطراب وتراجع عن فكرة إطلاقهم، فجمع جيشه ومراكبه لمطاردتهم وإرجاعهم. <br /><b>المعني الروحي  :</b> 
            قبل أن يعبروا البحر الأحمر ليعيشوا أربعين عامًا في البرية حتى يدخلوا أرض الوعد، ألزمهم الرب أن يقفوا أمام فم الحيروث، أي أمام الصعود القاسي، كأنه يعلن لهم مقدمًا أن طريق الخلاص هو صعود مستمر خلال الطريق الكرب والباب الضيق. <br />
            فالمؤمن لا يعرف التراخي بل الجهاد المستمر خلال شركته مع الله. أما موقع فم الحيروث فهو بين مجدل وبين بعل صفون، أي بين البرج والصعود السريع، بمعنى أن المؤمن يلتزم أن يُحسب نفقة بناء البرج حتى لا يبدأ ولا يقدر أن يكل فيهزأ المارة به، وإذ عرف حساباته التزم ألَّا يتباطأ في الطريق بل يصعد بسرعة نحو الحياة السماوية، أما كونها أمام البحر فهذا إعلان عن دخولنا في التجارب والضيقات طوال طريق جهادنا، حتى نعبر إلى الأرض الجديدة والسماء الجديدة حيث لا يكون للبحر موضع ( رؤ 21) </h2>,
            audio: "/audio/famHerooth.m4a",
            image:"/pics/famhorith.jpeg",
        },
        6: {
            title: "مارة",
            text: <h2>هو أحد المواقع التي مر بها بنو إسرائيل أثناء خروجهم من مصر حسب سفر الخروج في العهد القديم. 
                فبعدما كان بنو إسرائيل في فم الحيروث، ثم ضرب موسى عصاه البحر فشق البحر، وعبر بنو إسرائيل للضفة الأخرى من البحر الأحمر إلى الصحراء في شبه جزيرة سيناء. <br />
                فأخذ بنو إسرائيل يبحثون عن الماء، وظلوا ثلاثة أيام في الصحراء لا يجدون ماءً حتى وصلوا إلى مارة فجدوا بها ماءً لكنه مُر، لذلك سموها بهذا الاسم «مارة»، فدعا موسى ربه، فأره الرب شجرة وأمره أن يضعها في الماء، فلما وضعها في الماء أصبح الماء عذبًا. <br /><b>الموقع الفعلي :</b>  
                 الموقع الدقيق لمراة غير مؤكد، فيعتقد البعض أنها عين حوارة في وادي الإمارة، وهو ينبوع مالح على بعد 47 ميل جنوب شرق السويس. واقترح البعض بأنها عين نبع، وهي تقع على بعد 10 أميال فقط جنوب شرق السويس، كما اقترح آخرون تحديد «مارة» على أنها البحيرة الصغيرة المريرة التي تقع على بعد حوالي 20 ميلًا شمال السويس.<br /><b>المعني الروحي : </b>
                 وضع له فريضة وحكمًا: أي الوصية التي قالها الله:  سمح له بضيقة الماء المر ليظهر إيمانه بالله أو تذمره. <br />
                 صلى موسى بقوة لله فاستجاب له وأرشده أن يلقى شجرة أو فرع منها في الماء المر فصار عذبًا وشرب منه الشعب وارتوى.
وهكذا اجتاز موسى الإمتحان بنجاح من أجل إيمانه وصلاته وأما الشعب فظهر ضعفه في تذمره وعدم إيمانه.
<br />وكما طرح الشجرة في الماء ودفنت فيه فجعلته حلوًا، هكذا بدفن المسيح في القبر أحيانا من الموت وأعطانا حياة جديدة حلوة معه.
والشجرة ترمز للصليب الذي أتمَّ فداءنا فارتوينا من الروح القدس ووضع الشجرة في الماء يرمز إلى سر المعمودية الذي نلناه من بركات الصليب.
</h2>,
            audio: "/audio/mara.aac",
            image:"/pics/mara.jpeg",
        },
        7: {
            title: "إيليم",
            text: <h2>تمثل هذه المحطة في التاريخ الكتابي واحة التعزية والراحة الإلهية الكلية بعد فترات التعب والمرارة المفاجئة التي واجهت الشعب في بدائيات رحلتهم بالبرية. <br /><b>الطبيعة الجغرافية والموقع:</b>  
              كلمة "إيليم" في اللغة العبرية القديمة تعني "أشجار البطم" أو "الأشجار الضخمة"، وفي أحيان كثيرة تشير مباشرة إلى النخيل لعلوه وضخامته.  <br /><b>الوصف الجغرافي التاريخي:</b> 
              	وصفت إيليم في النصوص الكتابية (سفر الخروج 15: 27 وسفر العدد 33: 9) بأنها واحة غنية تحتوي على 12 عين ماء و 70 نخلة، مما جعلها مكاناً مثالياً للتخييم والاستراحة للشعب الغفير 
                <br /><b>السياق التاريخي والأحداث :</b> لم تشهد محطة إيليم أي أحداث حرب أو تذمر من الشعب، بل كانت محطة سلام تام تعقب فترة ضيق شديد
                <br /><b>الخلفية المباشرة (محطة مارة):</b>	 قبل الوصول إلى إيليم، سار الشعب في برية شور ثلاثة أيام دون العثور على ماء، وعندما وصلوا إلى محطة "مارة" وجدوا ماءً مرّاً لا يُشرب، فتذمروا على موسى. عندها صلى موسى واستجاب له الرب بإرشاده إلى شجرة ألقاها في الماء فصار عذباً. 
                <br /><b>التحرك نحو إيليم:</b>	 ارتحل الشعب من مارة المُرّة ووصلوا مباشرة إلى إيليم الواحة. 
                <br /><b>الاستقرار:</b>  تذكر النصوص: "فجاءوا إلى إيليم وهناك اثنتا عشرة عين ماء وسبعون نخلة. فنزلوا هناك عند الماء". لقد كانت المحطة بمثابة مكافأة إلهية سريعة وتعويض ملموس للشعب ليشتد عودهم قبل استكمال مسيرة البرية القاسية. 
                <br /><b>التفسير الروحي والرمزي:</b> تحمل تفاصيل محطة إيليم وأرقامها رموزاً لاهوتية وعميقة جداً في الفكر الروحي: 
                <br /><b>الـ 12 عين ماء:</b>	 ترمز جلياً إلى أسباط بني إسرائيل الاثني عشر في العهد القديم، وفي العهد الجديد ترمز إلى التلاميذ الاثني عشر الأطهار الذين فاضوا بمياه البشارة الحية والإنجيل الطاهر ليروا العالم أجمع. 
                <br /><b>الـ 70 نخلة:</b>	 ترمز في العهد القديم إلى شيوخ إسرائيل السبعين الذين اختيروا لمعاونة موسى في قيادة الشعب، وفي العهد الجديد ترمز بوضوح إلى السبعين رسولاً الذين أرسلهم السيد المسيح للكرازة. 
                <br /><b>الارتباط بين العيون والنخيل:</b>	 النخيل يستمد نموه وحياته من ارتواء جذوره بالمياه العذبة، وهذا يشير رمزياً إلى المؤمنين في الكنيسة (النخيل المثمر) الذين يرتوون على الدوام من ينابيع التعليم الرسولي النقي (العيون الاثنتي عشرة) المستمد أصلاً من السيد المسيح نبع الماء الحي.
                <br /><b>التتابع من مارة إلى إيليم:</b>	 هذا التحول يعكس الاختبار الروحي لكل مؤمن، فلا توجد مرارة أو ضيق (مارة) يستمران للأبد، إذ لا بد أن يعقبهما تعزية وراحة وسلام (إيليم). الصليب والآلام يمهدان الطريق دائماً نحو قوة القيامة والاستقرار الروحي 
                <br /><b>من أقوال الآباء القديسين</b><br />
ركز آباء الكنيسة الأولى في تفسيرهم لمحطة إيليم على البعد الرسولي والكرازي والأسراري للواحة:
<br /><b>القديس جيروم:</b>	 "إيليم هي مثال الكنيسة المقدسة المقامة على أساس تعليم الاثني عشر رسولاً والسبعين كرازياً. هناك نجد مياه المعمودية المقدسة والنقية (العيون) المنتشرة في المسكونة، ونجد المؤمنين كأشجار النخيل الروحية الشامخة القوية، المرتفعة بقلوبها نحو السماء، والتي لا يسقط ورقها أبداً، حاملة ثمار الفضائل الحلوة والمقدسة". 
<br /><b>القديس كيرلس الكبير:</b>	 "العيون والنخيل هما إشارة واضحة إلى الكنيسة الجامعة المشتركة، حيث يجتمع قادة العهدين بروح واحدة ليرعوا شعب الله المسافر. العيون تفيض بالمعرفة الروحية الحقة والتعليم الإلهي المشبع للنفوس المنهكة في برية هذا العالم الزائل". </h2>,
            audio: "/audio/eleem.m4a",
            image:"/pics/eleem.jpeg",
        },
        8: {
            title: "رفيديم",
            text: <h2>📍 موقع في البرية (سيناء ) <br />🏜️ منطقة قاحلة بدون ماء<br />💧 حدث ضرب موسى للصخرة وخروج الماء<br />⚔️ معركة بني إسرائيل مع العماليق<br />📖 مذكورة في سفر الخروج 17
<br />🚶‍♂️ تجربة واختبار في الإيمان<br />🙏 دعاء موسى ويداه المرفوعتان أثناء الحرب<br /><b>✨ دلالة:</b> الله يمدّ شعبه في وقت الحاجة</h2>,
            audio: "/audio/rafideem.mp4",
            image:"/pics/ramsis.jpeg",
        },
          9: {
            title: "جبل حوريب",
            text: <h2>تعتبر محطة جبل سيناء أبرز المحطات في رحلة خروج بني إسرائيل وتأسيس العهد. فلم تكن مجرد نقطة عبور أو راحة، بل كانت مكان اللقاء المهيب بين الله وشعبه، وفيها استلم موسى الوصايا العشر، وتأسست خيمة الاجتماع
             <br /><b>الطبيعة الجغرافية والوصف المكاني:</b> يتميز جبل سيناء بطبيعة جغرافية مهيبة تضفي جوًا من الرهبة والقداسة.
يقع في السلسلة الجبلية الجنوبية لشبه جزيرة سيناء، ويرتفع حوالي 2285 مترًا فوق مستوى سطح البحر. ويقع عند سفحه اليوم دير سانت كاترين الأثري. وتحيط به برية سيناء، ويوجد سهل واسع سمح بإقامة آلاف الخيام واستقرار الشعب طوال فترة إقامتهم. ويتكون الجبل من صخور الجرانيت الصلبة الشاهقة، مما يمنحه مظهرًا مهيبًا يرمز إلى عظمة الإعلانات الإلهية التي تمت فوقه.
<br /><b>السياق التاريخي والأحداث التي وقعت فيه:</b> وصل الشعب إلى برية سيناء في الشهر الثالث بعد خروجهم من أرض مصر (خروج 19: 1). وقضوا في هذه المحطة نحو:
<br />سنة كاملة تقريبًا. حوالي 11 شهرًا و20 يومًا. 
<br /> <b>أهم الأحداث:</b><br />•	تطهير الشعب وغسل ثيابهم والاستعداد للقاء الرب. <br />•	وضع حدود حول الجبل لمنع اقتراب إنسان أو حيوان حتى لا يموت. <br />•	في اليوم الثالث غطى الجبل سحاب كثيف، وصوت بوق ورعود وبروق ودخان، لأن الرب نزل عليه بالنار، وارتج الجبل كله. 
<br />•	صعد موسى إلى القمة حيث استلم لوحي الحجر المكتوبين بإصبع الله، وتلقى تفاصيل الشريعة والشرائع المدنية والطقسية وتنظيم حياة الشعب. <br />•	أمر الله موسى بصنع خيمة الاجتماع وتابوت العهد والمنارة والمذبح وثياب الكهنوت. 
<br /><b>حادثة العجل الذهبي</b><br />خلال غياب موسى أربعين يومًا صنع الشعب عجلًا ذهبيًا وعبدوه. <br />فنزل موسى غاضبًا وكسر اللوحين، ثم تشفع في الشعب فغفر الله لهم وجدد العهد 
<br /><b>التنظيم الرسمي الأول</b>تم في جبل سيناء أول تنظيم رسمي لبني إسرائيل في البرية، استعدادًا لمسيرتهم المستقبلية. <br /><b>التفسير الروحي والرمزي</b>
<br />يحمل جبل سيناء أبعادًا روحية ولاهوتية غنية. <br />•	النار والدخان والزلازل ترمز إلى عظمة الله وقداسته المطلقة التي لا تطيق الخطية، وتوضح أن الاقتراب من الله يستلزم التقديس والنقاوة وغسل الثياب. 
<br />•	صعود موسى المتكرر ونزوله يمثل الوسيط بين الله والشعب، ويرمز إلى المسيح الوسيط الذي صعد إلى السموات وينزل إلينا بالنعمة. <br />•	يقارن بولس الرسول بين جبل سيناء الذي يمثل العبودية والخوف، وبين جبل صهيون وأورشليم السماوية التي تمثل الحرية والنعمة (غلاطية 4، عبرانيين 12). 
<br />•	خيمة الاجتماع ترمز إلى التجسد، فكما حل الله في وسط الخيمة وسط الشعب، هكذا حل بيننا في المسيح. <br />•	تابوت العهد يرمز إلى الكنيسة وإلى مسكن الله. 
<br /><b>أقوال روحية</b><br />"الصعود على جبل سيناء هو رحلة النفس في طريق الفضيلة. ترك موسى الشعب أسفل الجبل وصعد، كذلك ينبغي للنفس أن ترتفع عن المحسوسات لتعاين الله بقلبها."
<br />"أعطي المسيح الناموس ليكشف للإنسان ثقل خطيته وحاجته إلى المخلص. وكما كُتبت الشريعة على ألواح حجرية، يكتبها بروحه على ألواح القلوب."<br />"انظروا إلى الفرق بين سيناء والكنيسة؛ ففي سيناء وقف الشعب بعيدًا، أما في الكنيسة فصار لنا الاقتراب إلى المذبح ليس بخوف العبيد بل بمحبة البنين، لأن المحبة الكاملة تطرح الخوف خارجًا."
<br />"بناء خيمة الاجتماع عند جبل سيناء يوضح أن الله لا يريد أن يعطينا وصايا فقط، بل يريد أن يسكن فينا، وكل نفس مسيحية هي خيمة روحية فيها تابوت العهد ومنارة الروح وكلمة الله المنيرة بالنعمة."</h2>,
            audio: "/audio/sinaiMount.mp4",
            image:"/pics/mount.jpeg",
        },
        10: {
            title: "تبعيرة",
            text:"مجدل كانت نقطة حراسة مصرية على حدود مصر الشرقية. خيّم بنو إسرائيل بالقرب منها قبل عبور البحر مباشرة. في هذا المكان بدا الشعب محاصرًا بين البحر وجيش فرعون، لكن الله حوّل الموقف المستحيل إلى أعظم معجزة خلاص في رحلة الخروج",
            audio: "/audio/first.mp3",
            image:"/pics/tabeera.jpeg",
        },
          11: {
            title: "قبروت هتأوة",
            text: <h2><b>الحدث التاريخي:</b> اشتهى بعض الشعب من بني إسرائيل أن يأكلوا لحمًا فتذكروا أيامهم في مصر و تذمروا على موسى و الرب فأرسل لهم الرب السلوى ليأكلوها  وهناك ضرب الرب الذين اشتهوا ضربة عظيمة جدًا و مات منهم كثيرين و دُفِنوا لذلك دُعي المكان قبروت هتأوة.
            <br /><b>الموقع الجغرافي:</b> في شمالي شرقي برية سيناء يبعد حوالي 25 كم شمالي جبل حوريب. <br /><b>معنى الاسم:</b>اسم عبري بمعنى قبور الشهوة أو مقبرة التأوه  
            <br /><b>الأهمية التاريخية:</b> بالوصول إليها انتقل الشعب تاريخيًا إلى برية فاران وهي المنطقة الصحراوية المكشوفة التي تقع على حدود كنعان  وهذا يعني بدء المرحلة الهجومية أو العسكرية للاقتراب من أرض الموعد.
            <br /><b>الأحداث الكتابية المرتبطة:</b> أمر الله موسى هناك بجمع سبعين رجلًا من شيوخ إسرائيل ليحملوا معه عبء الشعب وهناك حل الروح على هؤلاء الشيوخ فتنبأوا  يُعتَبَر هذا تاريخيًا النواة الأولى لبدء مجلس السنهدريم أي المجلس الأعلى لليهود لاحقًا.
            <br /><b>الدروس و التفسير الروحي:</b> الشهوة تُسبب الموت لو كانت خاطئة. <br /><b>رموز مسيانية و روحية: </b>كان الله يُرسِل للشعب المَن كل يوم و لكنهم رفضوه و أرادوا أن يأكلوا لحمًا فأرسل لهم السلوى يُعتَبَر المَن الذي رفضه الشعب رمزًا للسيد المسيح الذي رفضه اليهود. نجد مقارنة بين المًن و السيد المسيح في إنجيل يوحنا الإصحاح السادس، أرسل الله السلوى كاستجاب لتذمر الشعب و لكنها تحوَّلت إلى خطية و موت. يرى القديس كيرلس الإسكندري أن اللحم هنا يرمز إلى الجسدانيات و الشهوات المنحرفة وهو رمز روحي إلى أن استجابة الله لشهوات الإنسان المادية المُنحرفة قد تنتهي به إلى الموت الروحي. في هذا المكان اختر موسى سبعين شيخًا ليساعدوه في تدبير أمور الشعب ف حل عليهم الروح و تنبأوا ذلك يُذكِّرنا باختيار السيد المسيح للسبعين رسولًا كي يساعدوا في الخدمة و الكرازة ويُعتَبَر أيضًا حلول الروح عليهم رمزًا لحلول الروح القدس يوم الخمسين.
            <br />عندما اختار موسى السبعين شيخًا تخلَّف اثنان منهم هما ألداد و ميداد و لم يذهبا إلى المكان المُتفَق عليه  ولكن حل الروح عليهما و هما في المحلة و تنبآ أيضًا، ولكن يشوع أرد أن يمنعهما و موسى منعه متمنيًا أن يكون جميع الشعب أنبياء. وذلك الحدث يُذكرنا بما ذُكِر في إنجيل مرقس الإصحاح التاسع حين رأى التلاميذ شخصًا يُخرِج الشياطين باسم المسيح و لكنه ليس من التلاميذ فأرادوا أن يمنعوه و لكن السيد المسيح رفض قائلًا لا تمنعوه .. من ليس علينا فهو معنا، وذلك يرمز إلى أن عمل الروح القدس و نعمة المسيح تمتد لكل قلب مُستعد.</h2>,
            audio: "/audio/kabarootHatawa.m4a",
            image:"/pics/ramsis.jpeg",
        },
        12: {
            title: "حضيروت",
            text:"مجدل كانت نقطة حراسة مصرية على حدود مصر الشرقية. خيّم بنو إسرائيل بالقرب منها قبل عبور البحر مباشرة. في هذا المكان بدا الشعب محاصرًا بين البحر وجيش فرعون، لكن الله حوّل الموقف المستحيل إلى أعظم معجزة خلاص في رحلة الخروج",
            audio: "/audio/hadayroot.aac",
            image:"/pics/hadairoot.jpeg",
        },
        13: {
            title: "مقهيلوت",
            text: <h2><b>المعنى: </b> مجمعات أو جماعات <br /><b>المرجع الكتابي: </b>عدد 33:25-26 <br /><b>أهميتها:</b> محطة من محطات التيه الأربعين<br /><b>الدرس الروحي: </b> الله يقود شعبه حتى في المراحل الهادئة من الحياة</h2>,
            audio: "/audio/first.mp3",
            image:"/pics/makhiloot.jpeg",
        },
        14: {
            title: "جبل هور",
            text: <h2><b>📍 الموقع الجغرافي</b> ⛰️ جبل/تضاريس صخرية<br /><b>📖 الحدث الكتابي </b> (سفر العدد 20) <br /><b>👑 انتقال الكهنوت </b> (هارون → ألعازار) <br />⚰️ وفاة هارون <br />✨ دلالة روحية / رسالة إلهية <br />🔥 حضور الله وخطة مستمرة<br />🏜️ بيئة صحراوية</h2>,
            audio: "/audio/hourMount.m4a",
            image:"/pics/mount.jpeg",
        },
        15: {
            title: "قادش برنيع",
            text:"مجدل كانت نقطة حراسة مصرية على حدود مصر الشرقية. خيّم بنو إسرائيل بالقرب منها قبل عبور البحر مباشرة. في هذا المكان بدا الشعب محاصرًا بين البحر وجيش فرعون، لكن الله حوّل الموقف المستحيل إلى أعظم معجزة خلاص في رحلة الخروج",
            audio: "/audio/kadeshBarnee.aac",
            image:"/pics/ramsis.jpeg",
        },
        16: {
            title: "عصيون جابر",
            text:"مجدل كانت نقطة حراسة مصرية على حدود مصر الشرقية. خيّم بنو إسرائيل بالقرب منها قبل عبور البحر مباشرة. في هذا المكان بدا الشعب محاصرًا بين البحر وجيش فرعون، لكن الله حوّل الموقف المستحيل إلى أعظم معجزة خلاص في رحلة الخروج",
            audio: "/audio/esionGaber.mp4",
            image:"/pics/esyoonGaber.jpeg",
        },
        17: {
            title: "جدجاد",
            text: <h2><b>📍 الموقع:</b> برية وعرة بين الجبال والأودية<br /><b>⛰️ الطبيعة:</b> جبال وأخاديد صخرية<br /><b>🚶 الحدث:</b> محطة في رحلة الخروج<br /><b>💧 الموارد: </b> مصادر مياه محدودة <br /><b>✨ الدرس الروحي:</b> الثقة في قيادة الله<br /><b>📖 المرجع:</b> العدد 33: 32-33
<br /><b>🎯 الفكرة الأساسية:</b> الله يقود شعبه حتى في المحطات الهادئة</h2>,
            audio: "/audio/first.mp3",
            image:"/pics/ramsis.jpeg",
        },
        18: {
            title: "فونون",
            text: <h2>📍 موقع صحراوي بين الجبال<br />💧 مصادر مياه / بئر (منطقة استراحة) <br />⚠️ محطة صعبة وخطرة في الرحلة <br />⛰️ تضاريس جبلية وعرة<br />📖 ذكرت في سفر العدد (كمحطة توقف) <br />🚶‍♂️ توقف بني إسرائيل أثناء الرحلة <br />🔥 اختبار وصبر في البرية
<br /><b>✨ معنى روحي:</b> الله بيقود وسط الصعوبات </h2>,
            audio: "/audio/fonon.aac",
            image:"/pics/ramsis.jpeg",
        },
        19: {
            title: "قير",
            text: <h2><b>📍 الموقع:</b> أرض موآب<br /><b>🏜️ الطبيعة:</b> هضاب وأودية صخرية <br /><b>🚶 المرحلة:</b> من آخر محطات الرحلة<br /><b>🎯 الأهمية:</b> الاقتراب من أرض الموعد
<br /><b>🛡️ المعنى:</b> الحصن أو السور<br /><b>📖 الدرس الروحي:</b> الثبات حتى النهاية<br /><b>⏳ الفترة:</b> قبل عبور الأردن مباشرة<br /><b>✨ الرسالة:</b> مواعيد الله أقرب مما نتخيل</h2>,
            audio: "/audio/keer.mp4",
            image:"/pics/ramsis.jpeg",
        },
        20: {
            title: "حشبون",
            text: <h2><b>📍 الموقع:</b>  🏰 مدينة ملوك قديمة (سيحون) <br />💧 آبار ومياه (مدينة مرتفعة) <br />⚔️ معارك بني إسرائيل <br />📖 مذكورة في سفر العدد والتثنية <br />🧭 ضمن شرق الأردن (موآب) <br />✨ دلالة: نصر وتمكين بعد عبور البرية</h2>,
            audio: "/audio/hashboon.m4a",
            image:"/pics/ramsis.jpeg",
        },
         21: {
            title: "جبل نبو",
            text: <h2>📍 موقع مرتفع في الأردن (قرب مأدبا) <br />⛰️ جبل عالي وإطلالة على أرض كنعان <br />👁️ رؤية أرض الموعد من بعيد <br />📖 ذكر في سفر التثنية (تثنية 34)
<br />🧑‍🦯 موسى وقف عليه قبل وفاته<br />⚰️ نهاية رحلة موسى على الأرض<br />✨ وعد الله وتحقيق الرؤية<br />🕊️ سلام وتسليم القيادة لله</h2>,
            audio: "/audio/nebwMount.aac",
            image:"/pics/ramsis.jpeg",
        },
    };
     const [showImage,setShowImage]=useState(false);
    const audioRef= useRef(null);
    if (!isOpen) return null;
    const handleClose =()=> {
        if (audioRef.current){
            audioRef.current.pause();
            audioRef.current.currentTime=0;
        }
        onClose();
    }
   
    return (
        <div className="fixed inset-0 bg-black/50 flex justify-center items-center z-50">
            <div className="bg-white rounded-lg w-150 max-h-150 overflow-y-auto p-6 ">
                
                    <div className="flex justify-between mb-4" >
                        <h2 className="text-2xl font-bold">{content[button]?.title}</h2>
                        <button onClick={handleClose} className=" flex justify-end font-semibold text-2xl cursor-pointer hover:text-amber-900 hover:scale-120 transition">x</button>
                    </div>
                    
                    <div className="flex items-center gap-4">
                    <Sound audioRef={audioRef} />
                    <audio ref={audioRef} src={content[button]?.audio}/>
                    </div>
                    <div className="text-amber-700 ">
                        <hr />
                    </div>
                    <div className="flex justify-center my-4">
                        <img src={content[button]?.image} alt={content[button]?.title} className="w-48 rounded-lg cursor-pointer hover:scale-100 transition" onClick={()=>setShowImage(true)} />
                    </div>
                    
                 <p className="text-right leading-8" dir="rtl">{content[button]?.text}</p>
                </div>
                {showImage && (
    <div
        className="fixed inset-0 bg-black/80 flex justify-center items-center z-60"
        onClick={() => setShowImage(false)}
    >
        <img
            src={content[button]?.image}
            alt={content[button]?.title}
            className="max-w-[50vw] max-h-[50vh] rounded-lg"
            onClick={(e) => e.stopPropagation()}
        />
    </div>
)}
               
            </div>

        
    )
}
